Работа с данными в Pandas

Задание 1

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_id' : [1, 2, 3], 'author_name' : ['Тургенев', 'Чехов', 'Островский']})

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [4]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]})

In [5]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [7]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [8]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [10]:
top5 = authors_price.nlargest(5, 'price')

In [11]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [32]:
minPrice = authors_price.groupby('author_name').agg({'price':'min'})

In [33]:
minPrice

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [34]:
minPrice = minPrice.reset_index()
minPrice = minPrice.rename(columns={'price':'min_price'})

In [35]:
minPrice

  author_name  min_price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [39]:
maxPrice = authors_price.groupby('author_name').agg({'price':'max'})
maxPrice = maxPrice.reset_index()
maxPrice = maxPrice.rename(columns={'price':'max_price'})

In [40]:
meanPrice = authors_price.groupby('author_name').agg({'price':'mean'})
meanPrice = meanPrice.reset_index()
meanPrice = meanPrice.rename(columns={'price':'mean_price'})

In [43]:
maxMinPrice = pd.merge(minPrice, maxPrice, on = 'author_name', how = 'inner')

In [44]:
authors_stat = pd.merge(maxMinPrice, meanPrice, on = 'author_name', how = 'inner')

In [46]:
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

Задание 5

In [47]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [48]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [54]:
import numpy as np
book_info = pd.pivot_table(authors_price,
               values = 'price',
               index = ['author_name'], 
               columns = ['cover'],
               aggfunc = np.sum)

In [55]:
book_info

cover        мягкая  твердая
author_name
Островский    660.0      NaN
Тургенев      650.0    450.0
Чехов           NaN    950.0

In [59]:
book_info['мягкая'] = book_info['мягкая'].fillna('0')
book_info['твердая'] = book_info['твердая'].fillna('0')

In [60]:
book_info

cover       мягкая твердая
author_name
Островский   660.0       0
Тургенев     650.0   450.0
Чехов            0   950.0

In [62]:
book_info.to_pickle('book_info.pkl')

In [63]:
book_info2 = pd.read_pickle('book_info.pkl')

In [64]:
book_info2

cover       мягкая твердая
author_name
Островский   660.0       0
Тургенев     650.0   450.0
Чехов            0   950.0